package com.example.touristguide.data.repository

import android.annotation.TargetApi
import android.os.Build
import android.util.Log
import androidx.annotation.RequiresApi
import com.example.touristguide.domain.entities.Achievement
import com.example.touristguide.domain.entities.Route
import com.example.touristguide.domain.entities.Sight
import com.example.touristguide.domain.interfaces.Repository
import kotlinx.coroutines.flow.MutableStateFlow
import kotlinx.coroutines.flow.asStateFlow
import org.osmdroid.util.GeoPoint
import java.time.LocalDateTime
import java.time.LocalTime
import kotlin.collections.distinct

class TestRepository: Repository {
    private val allSights: List<Sight>? = null
    private val categoriesList: List<String>? = null

    private val _allRoutes = MutableStateFlow<List<Route>>(mutableListOf())
    override val allRoutes = _allRoutes.asStateFlow()

    override suspend fun getSight(id: Int): Sight {
        return getAllSights().find { id == it.id }!!
    }

    override suspend fun getAllSights(): List<Sight> {
        if (allSights != null) {
            return allSights
        }
        return listOf(
            Sight(
                id = 34245,
                title = "Клуб виртуальной реальности «Нереальное место»",
                address = "Нижний Сусальный пер., д. 5, стр. 5А",
                timetable = "пн–пт 12:00–0:00, сб, вс 10:00–0:00",
                phone = "+7 495 121-33-62",
                description = "Десятки VR-игр всех жанров для всех возрастов, площадка для праздников и нереальная атмосфера киберпанка — всё это ждёт гостей одного из крупнейших VR-клубов Москвы.",
                bodyText = "Согласно Tripadvisor, с 2016 года клуб не покидает топ-10 лучших развлечений столицы. За время существования клуба в нём побывало более 100 000 человек из разных стран мира. \nВ клубе можно классно отдохнуть с друзьями, прийти с детьми, устроить свидание, а также отметить день рождения, провести корпоратив или детский праздник.\nОрганизаторы гордятся интерьерами клуба, которые придают каждому залу индивидуальность и узнаваемость, собственный характер.\nЗал № 1: ZION \nВыполнен в стиле гранж и киберпанк. В декоре отсылки на фильм «Матрица».\nФото: предоставлено организатором\nЗал № 2: Night City \nВыполнен в стиле Токийского киберпанка. В декоре отсылки на игру «Cyberpunk 2077».\nФото: предоставлено организатором\nКак всё происходит?\nВы бронируете время, приходите в клуб и выбираете игры. В «Нереальном месте» 70 VR-игр всех жанров и для всех возрастов (для детей от 8 лет).\nФото: предоставлено организатором\nВас пригласят в игровые зоны и будут сопровождать на протяжении всего времени — с каждыми двумя гостями работает отдельный администратор. Даже те, кто совсем не знаком с видеоиграми, получат огромное удовольствие!\nНереальный праздник\nФото: предоставлено организатором\nКлуб виртуальной реальности «Нереальное место» — это отличный выбор для проведения дня рождения, корпоратива и детского праздника! Здесь есть игры на любой вкус, возраст (от 8 лет), состав и размер компании. Кроме того, можно играть как командой, так и соревноваться друг с другом! \nПодробнее про организацию праздника можно узнать в специальном разделе на сайте.\nРадость для детей и взрослых\nФото: предоставлено организатором\nДети и подростки любят игры в виртуальной реальности, но и родителям будет не скучно: вместе погружаться в фантастические миры очень весело!\nРебёнок будет под присмотром\nФото: предоставлено организатором\nЕсли вам нужно отойти, то можете оставить ребёнка под присмотром сотрудников клуба. Здесь можно не переживать о безопасности, ведь даже о стену удариться невозможно, так как в клубе они мягкие!\nВоспользуйтесь Лаундж-зоной для работы \nФото: предоставлено организатором\nЕсли вам нужно поработать, пока дети заняты игрой, то в зоне отдыха вы найдёте комфортные диваны, столы, быстрый Wi-Fi, напитки.\nОснователь клуба Кирилл Круглов:\nЯ был уверен, что играть в сетевые VR-игры будет очень весело, но понимал, что мало кто из моих друзей решит купить VR-систему за 250 000 ₽ (VR-шлем + мощный игровой компьютер) и выделит под неё отдельную комнату. Тогда я придумал клуб и создал его именно таким, каким хотел для себя — с большими игровыми зонами, мягкими стенами и системой подвески проводов. И каждый день, приходя в клуб, я думаю над тем, что можно улучшить, чтобы я, мои друзья и гости могли лучше проводить здесь время.\nУзнать подробности можно на официальном сайте.\nЗа новостями следите ВКонтакте.\nЧасто задаваемые вопросы\nЧто представляет собой аттракцион «Нереальное место»?\n«Нереальное место» — это уникальный развлекательный комплекс, где сочетаются элементы виртуальной реальности и интерактивных локаций. Посетители могут погрузиться в захватывающие приключения и исследовать удивительные миры.\nДля какой возрастной группы предназначен аттракцион?\nАттракцион подходит для детей старше 6 лет и взрослых. Рекомендуется учитывать возрастные ограничения, указанные на билетах.\nКак можно приобрести билеты на аттракцион?\nБилеты можно приобрести на официальном сайте аттракциона или на месте в день посещения, но рекомендуется бронировать заранее, чтобы избежать очередей.",
                url = "https://www.nerealnoemesto.ru/",
                coords = GeoPoint(55.75981199999999, 37.66422499999958),
                subway = "",
                images = listOf("https://media.kudago.com/images/place/67/5f/675f550a4878b642807120675afa1646.jpg"),
                categories = listOf("развлечения", "дети", "достопримечательности")
            ),
            Sight(
                id = 35922,
                title = "Сказочный музей «Особняк-Небылица»",
                address = "Озерковский пер., д. 1/18",
                timetable = "ежедневно 10:00–22:00 (касса: ежедневно 10:00–21:20)",
                phone = "+7 936 555-53-33",
                description = "На Озерковой набережной появился удивительный музей. Внешне это обычный дом, но переступив его порог, гости попадают в сказочную вселенную. Гостей ждёт знакомство с лешими, русалками, былинными героями и разнообразными фантастическими существами.",
                bodyText = "«Особняк-Небылица» ждёт всех, кто смел, любопытен и верит в чудеса. Проводником по волшебному особняку станет профессор Апполинарий Феликсович Московин — хранитель ключей от ворот в сказку.\nДля авторов московского «Особняка-Небылицы» это уже третий проект. Первые два — «Особняк-Небылица» и «Небылица-Водица» — находятся в Санкт-Петербурге. Над созданием московской экспозиции, как и над предыдущими музеями, работала большая команда художников, декораторов, бутафоров и литераторов, использовались новейшие мультимедийные технологии. В результате получилось сказочное пространство, проработанное в мельчайших деталях и населённое волшебными персонажами, каждый из них — со своей историей.\nПосетители музея становятся путешественниками и исследователями волшебных тайн. Они побывают в загадочной библиотеке и в заснеженном лесу, населённом ледяными феями, поднимутся по Драконьей лестнице, отправятся в гости к Кащею Бессмертному, познакомятся с обитателями Доброго замка. И это далеко не все приключения. \nВ музее есть потайные двери, смотрители подскажут, как их отыскать. Узнать интересные факты об экспонатах музея поможет аудиогид, доступный по QR-кодам, размещённым на табличках. А полностью погрузиться в волшебный мир можно на увлекательных экскурсиях по особняку.\nСказочные впечатления ждут гостей музея всех возрастов. На третьем этаже музея расположено уютное кафе, где так приятно отдохнуть после сказочного путешествия и поделиться впечатлениями друг с другом.\nСтоимость билетов: детский — от 1200 рублей, взрослый — от 1500 рублей.\nПодробности — на официальном сайте. Присоединяйтесь ВКонтакте.\nФото: предоставлены организатором",
                url = "https://москва-небылица.рф",
                coords = GeoPoint(55.741000999999855, 37.63743079999956),
                subway = "Новокузнецкая, Третьяковская",
                images = listOf("https://media.kudago.com/images/place/37/da/37da4d1aa6a805889924508432e328eb.jpg"),
                categories = listOf("развлечения", "дети", "музеи")
            ),
            Sight(
                id = 1734,
                title = "Каток в саду «Эрмитаж»",
                address = "ул. Каретный ряд, д. 3, стр. 7",
                timetable = "ежедневно 10:00–23:00",
                phone = "+7 906 012-77-75",
                description = "В московском саду «Эрмитаж» зимой традиционно открывается каток с искусственным льдом. Катание пройдёт гладко!",
                bodyText = "Как провести тёплый зимний денёк? Конечно, покататься на коньках! В саду «Эрмитаж» уютный каток с искусственным ледовым покрытием работает и при плюсовой температуре. Его площадь составляет 900 м². За гладкость поверхности переживать не приходится: ледовая машина трудится неустанно. \nВыйти на лёд можно по билету, купленному онлайн. Посещение возможно строго по сеансам: с 10:00 до 12:00, с 13:00 до 16:00, с 17:00 до 20:00, с 21:00 до 23:00.",
                url = "https://www.mosgorsad.ru/rest/katok/",
                coords = GeoPoint(55.77079599999999, 37.60927199999999),
                subway = "Чеховская",
                images = listOf("https://media.kudago.com/images/place/8b/fc/8bfcd1317b116246b1c31babd88a9c40.jpeg"),
                categories = listOf("парк", "аттракционы", "досуг")
            ),
            Sight(
                id = 936,
                title = "Центр современного искусства «М'АРС»",
                address = "пер. Пушкарёв, д. 5",
                timetable = "ежедневно 12:00–22:00",
                phone = "+7 495 623-66-90",
                description = "Центр современного искусства М'АРС — пространство, где искусство встречается с новейшими технологиями, создавая незабываемые впечатления. Один из первых музеев в России, который исследует digital art, VR-искусство и мультимедиа, предлагает не просто выставки, а полное погружение в захватывающий мир зрелищных инноваций.",
                bodyText = "Каждая выставка превращается в иммерсивное путешествие, где зрители становятся частью художественного процесса. Здесь проходят мультимедиа-шоу, интерактивные инсталляции, фестивали цифрового искусства и концерты электронной музыки. А также образовательные программы и Ночи искусств, которые объединяют современную культуру и технологии.\nМ'АРС — это площадка с атмосферными локациями, где зрители всех возрастов открывают для себя новые грани искусства. Это место для творческих экспериментов, где технологии усиливают художественные образы, создавая мощный эмоциональный отклик, который невозможно забыть.\nС момента основания, в 1988 году, Центр стал пионером в экспонировании и продвижении современного искусства, а с середины 2000-х сосредоточился на мультимедиа, виртуальной и дополненной реальности. \nЧасто задаваемые вопросы\nКакова основная концепция Центра «М'АРС»?\nЦентр современного искусства «М'АРС» фокусируется на мультимедийном искусстве и взаимодействии зрителей с произведениями. Это позволяет зрителям глубже погрузиться в экспозиции.\nКакие события проводятся в Центре «М'АРС»?\nВ Центре регулярно организуются выставки и перформансы, где как российские, так и зарубежные художники демонстрируют свои работы и делятся опытом.\nКаковы часы работы Центра «М'АРС»?\nЦентр работает ежедневно с 12:00 до 22:00, обеспечивая доступность для посетителей в удобное время.",
                url = "http://centermars.ru/",
                coords = GeoPoint(55.768907, 37.626951),
                subway = "Сухаревская, Трубная, Цветной бульвар",
                images = listOf("https://media.kudago.com/images/place/00/d1/00d1a23bc86edc13c9aaa43e5599c7e3.JPG"),
                categories = listOf("музеи")
            ),
            Sight(
                id = 18778,
                title = "Креативное пространство «Люмьер-Холл»",
                address = "Берсеневский пер., д. 2, стр. 1",
                timetable = "ежедневно 11:00–23:00",
                phone = "+7 999 877-10-78",
                description = "В креативном пространстве «Люмьер-Холл» благодаря мультимедийным выставкам оживают полотна великих мастеров, ценители кинематографа получают удовольствие от тематических кинопоказов, а на концертах и фестивалях кипит яркая, современная, полная впечатлений жизнь.",
                bodyText = "В большом мультимедийном зале «Люмьер-Холла» установлено двадцать панорамных экранов с разрешением 6 тысяч пикселей. Объёмный звук, общая площадь изображения 500 квадратных метров, 2D- и 3D-анимация, технология мультипоточного проецирования создают у гостей эффект полного присутствия. Здесь, в мультимедийном зале, проходят выставки, кинопоказы, музыкальные концерты, фестивали, презентации и деловые встречи.\nНа выставках формата «ожившие полотна» зрители могут полюбоваться картинами известных художников сразу на множестве экранов. Изображение проецируется в формате Full HD и сопровождается объёмным звуковым рядом. Картины приближаются и отдаляются, детали и предметы приходят в движение, и посетители словно погружаются в творческие миры живописцев.\nВ «Люмьер-Холле» регулярно проходят тематические кинопоказы. Организаторы радуют эстетов подборками чёрно-белых лент, демонстрируют анимационные фильмы, устраивают ретроспективы звёздных режиссёров и балуют публику новыми хитами. Зрители располагаются на мягких пуфиках, причём сами выбирают, где их разместить. Для тех, кто предпочитает классические показы, работает зал с одним экраном.\nПерекусить и выпить чашечку кофе можно в кафе «Люмьер-Холла».  \n \nПодробности узнавайте на сайте. За расписанием показов и выставок следите ВКонтакте.\nЧасто задаваемые вопросы\nКакие события можно посетить сегодня в пространстве «Люмьер-Холл»?\nАктуальное расписание мероприятий можно найти на сайте «Люмьер-Холла», где представлено расписание на ближайшие дни.\nКакой формат события можно выбрать?\n«Люмьер-Холл» проводит выставки, кинопоказы, музыкальные концерты, фестивали, презентации и деловые встречи.\nЕсть ли ограничения по возрасту для участия?\nДа, в проекте могут принимать участие люди старше 12 лет. Для детей младше необходимо сопровождение взрослого.",
                url = "http://www.lumierehall.ru",
                coords = GeoPoint(55.74076718192345, 37.60991006382213),
                subway = "Кропоткинская, Полянка",
                images = listOf("https://media.kudago.com/images/place/72/fd/72fdca056b037c8f7eff5ac304d73282.jpg"),
                categories = listOf("коворкинг", "аттракционы", "достопримечательности", "кинотеатры")
            ),
            Sight(
                id = 970,
                title = "Каток в парке Горького",
                address = "ул. Крымский Вал, д. 9",
                timetable = "вт–вс 10:00–21:30",
                phone = "",
                description = "Один из самых популярных зимних катков в Москве — каток в Парке Горького. Здесь каждую зиму заливают Фонтанную площадь и аллеи — получается масштабное ледовое пространство с атмосферой зимней сказки.",
                bodyText = "Гости катка попадают в настоящий зимний городок. Ледовые аллеи украшают светящиеся гирлянды, фотографии и арт-объекты, главный из которых расположен в чаше фонтана.\nУ центрального павильона проката установлена Медиарубка — студия с прозрачными стенами, в которой выступают артисты и диджеи, а звук транслируется на весь каток. Во время сеансов, на которых действует специальная цена для пенсионеров, звучат ретро-хиты. \nНа катке работают кафе и фудкорты с чаем, хот-догами, пончиками и другой ароматной, с пылу с жару уличной едой. А на площадке «Очаг» посетителей ждёт настоящий костёр и скамейки с подогревом.\nДля юных посетителей действует отдельный детский каток. А любители хоккея могут арендовать ледовую площадку для дружеских и профессиональных игр.",
                url = "",
                coords = GeoPoint(55.72949799999995, 37.60619999999998),
                subway = "Октябрьская, Парк Культуры",
                images = listOf("https://media.kudago.com/images/place/18/fd/18fd1d7417873f00103cde6ef09e1e04.jpg"),
                categories = listOf("развлечения", "дети", "досуг")
            ),
            Sight(
                id = 30400,
                title = "Парк «Зарядье»",
                address = "ул. Варварка, д. 6",
                timetable = "ежедневно весь день",
                phone = "+7 495 531-05-00",
                description = "В самом сердце Москвы есть масштабный парк с разнообразным ландшафтом, уникальным парящим мостом и амфитеатром.",
                bodyText = "«Зарядье» — это первый крупный столичный парк, который открылся в городе за последние семьдесят лет. Он уникален прежде всего организацией ландшафтных зон. Здесь вам точно будет не скучно гулять — вы увидите настоящий смешанный лес, степь с душистыми травами, живописные заливные луга с водоёмами и ландшафт арктических земель с мхами и можжевельником. В каждой зоне поддерживается особый микроклимат с подходящим уровнем температуры и влажности.\nПосле променада по зелёной зоне парка вы можете отправиться на набережную, полюбоваться Москвой-рекой, посидеть в уютном кафе или покататься на речном трамвае. И обязательно поднимитесь на второй уровень набережной, где находится не имеющий аналогов «Парящий мост». Он в буквальном смысле парит над рекой — 70-метровая конструкция выглядит совершенно воздушной и легкой, при этом она не имеет дополнительных опор. Отсюда вам откроется потрясающий вид на храм Христа Спасителя.\nВ медиацентре посетителей ждут самые интересные экспозиции, интерактивные шоу и кинопоказы в прогрессивном кинозале со спецэффектами, а в концертном зале с амфитеатром — выступления ведущих музыкантов и театральных актёров. А если вам хочется чего-то экзотического и необычного, посетите ледяную пещеру и узнайте о флоре и фауне Заполярного края.\nПарк ждёт всех гостей в любой день недели. Вход свободный. Расписание работы павильонов уточняйте заранее на официальном сайте парка.",
                url = "https://vk.com/zaryadyepark",
                coords = GeoPoint(55.75287499999981, 37.6287235),
                subway = "Китай-город",
                images = listOf("https://media.kudago.com/images/place/31/6c/316c54357f8722eefba532f89d023e85.jpg"),
                categories = listOf("парк", "аттракционы", "досуг")
            ),
            Sight(
                id = 684,
                title = "Ресторан «Турандот»",
                address = "бул. Тверской, д. 26, стр. 3",
                timetable = "ежедневно 12:00–0:00",
                phone = "+7 495 531-05-00",
                description = "Ресторан «Турандот» — пышный дворец в духе барокко «шинуази» (от французского слова chinois, китайский), в котором подают блюда азиатской и европейской кухни.",
                bodyText = "Ресторан располагается в старинном особняке конца XVIII века. В течение шести лет здание реставрировали и оформляли внутреннее убранство. Результат получился таким пышным и богатым, какого не удалось бы добиться и два века назад.\nВ ресторане несколько залов, у каждого из которых своё название. Первым встречает гостей «Флорентийский дворик». «Центральный» зал занимает два этажа с лаунж-зоной и классическим рестораном. Основной зал обрамляют восемь «Приватных кабинетов», каждый из которых выполнен в своём особенном стиле. В «Фарфоровом» и «Парадном» все детали пропитаны богатством и роскошью. Завершает эту феерию роскоши не менее уникальная Трельяжная терраса, расположившаяся на крыше исторического особняка.\nВ каждом из залов, без сомнения, есть своя изюминка: гобелены, выполненные современными французскими мастерами по старинным эскизам или оригинальные венецианские зеркала XVIII века, с тех же пор сохранившиеся венецианские деревянные фонари или оригинальные китайские вазы и тарелки.\nПричудливая вычурность «Турандот» заключается в соединении барочного интерьера и восточной кухни. Хотя «Турандот» позиционирует себя как китайский ресторан, его многосоставное меню включает ещё и классику японской и европейской кухни. «Зелёный салат с хрустящей уткой», «Борщ со спелой вишней и круассанами с фуа-гра», «Чилийский сибас в медовом соусе» — блюда называются и выглядят ярко, кукольно, барочно.\nПерсонал ресторана выглядит как настоящие лакеи, дворецкие и горничные, одетые согласно эпохе и стилю — от воротничка до обуви. «Турандот» проводит свадьбы, деловые встречи, званые ужины и обеды. В ресторане работает детский аниматор. Машины посетителей паркуют на специальной подземной стоянке.\nОсматривая царских масштабов особняк, становится понятно, почему на его воссоздание потребовалось целых шесть лет. А теперь «Турандот» по праву считается одним из наиболее величественных и достойных ресторанов города.",
                url = "https://vk.com/turandot.palace",
                coords = GeoPoint(55.7637, 37.60503199999999),
                subway = "Пушкинская, Тверская",
                images = listOf("https://media.kudago.com/images/place/8d/23/8d23607b29f5ac10c5ce81adc4715d88.png"),
                categories = listOf("рестораны")
            )
        )
    }

    @RequiresApi(Build.VERSION_CODES.O)
    override suspend fun addNewRoute(order: List<Sight>) {
        val id = (_allRoutes.value.maxOfOrNull { it.id } ?: 0) + 1
        val changedRoutes = _allRoutes.value.toMutableList()
        changedRoutes.add(Route(
            id = id,
            order = order,
            isPassed = List(order.size) { false },
            totalTime = LocalTime.of(0, 0),
            date = LocalDateTime.now(),
            status = Route.Status.NOT_STARTED
        ))
        _allRoutes.value = changedRoutes
        Log.d(DB_TAG, "New route added: ${id}.")
    }

    override suspend fun getPassedRoutes(): List<Route> {
        return _allRoutes.value.filter { it.status == Route.Status.PASSED }
    }

    override suspend fun getDeclinedRoutes(): List<Route> {
        return _allRoutes.value.filter { it.status == Route.Status.DECLINED }
    }

    override suspend fun getRoutesInProgress(): List<Route> {
        return _allRoutes.value.filter { it.status == Route.Status.IN_PROGRESS }
    }

    override suspend fun updateRoute(
        routeId: Int,
        newRoute: Route
    ) {
        val changedRoutes = _allRoutes.value.toMutableList()
        changedRoutes.removeIf { it.id == routeId }
        changedRoutes.add(newRoute)
        _allRoutes.value = changedRoutes
    }

    override suspend fun getAllAchievements(): List<Achievement> {
        TODO("Not yet implemented")
    }

    override suspend fun getCompletedAchievements(): List<Achievement> {
        TODO("Not yet implemented")
    }

    override suspend fun updateAchievement(
        achievementId: Int,
        newAchievement: Achievement
    ) {
        TODO("Not yet implemented")
    }

    override suspend fun registrate() {
        TODO("Not yet implemented")
    }

    override suspend fun login() {
        TODO("Not yet implemented")
    }

    override suspend fun getAllCategories(): List<String> {
        if (categoriesList != null) {
            return categoriesList
        }
        val allSightsList = getAllSights()
        return allSightsList.flatMap { it.categories }.distinct().sorted()
    }

    companion object {
        const val DB_TAG = "DB TAG"
    }

}